eisup_2019_docmng_integration/src/DataProcessors/ПомощникПодготовкиУведомленияОКонтролируемыхСделках/ПомощникПодготовкиУведомленияОКонтролируемыхСделках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникПодготовкиУведомленияОКонтролируемыхСделках</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уведомление</name>
    <type>
      <types>DocumentRef.УведомлениеОКонтролируемыхСделках</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

eisup_2019_docmng_integration/src/InformationRegisters/ВзаимозависимыеЛица/ВзаимозависимыеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВзаимозависимыеЛица</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТипВзаимозависимости</name>
    <type>
      <types>EnumRef.ТипыВзаимозависимости</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяПлательщикомНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяПлательщикомНДПИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяПлательщикомЕСХН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяПлательщикомЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВОЭЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/УчастникиКонтролируемыхСделок/УчастникиКонтролируемыхСделок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиКонтролируемыхСделок</name>
  <resources>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВСтранеСЛьготнымНалогообложением</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомерВСтранеРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодНалогоплательщикаВСтранеРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодВидаДеятельностиФизическогоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ТипыВзаимозависимости/ТипыВзаимозависимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВзаимозависимости</name>
  <enumValues>
    <name>НеВзаимозависимы</name>
  </enumValues>
  <enumValues>
    <name>ВзаимозависимыПоКодексу</name>
  </enumValues>
  <enumValues>
    <name>СамостоятельноеПризнаниеВзаимозависимости</name>
  </enumValues>
  <enumValues>
    <name>ВзаимозависимостьПоРешениюСуда</name>
  </enumValues>
  <enumValues>
    <name>НеВзаимозависимыйПосредник</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <comment>(Общ)</comment>
  <basedOn>Catalog.Организации</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписание</name>
    <comment>(Общ) Дополнительное описание</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииПриОбращении</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВидДеятельности</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ВидыДеятельностиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджерПокупателя</name>
    <comment>(Упр) Основной менеджер</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеРаботыСтрокой</name>
    <comment>(Общ) Расписание работы строкой</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполненияЗаказаПоставщиком</name>
    <comment>(Упр)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЯвляетсяРезидентом</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКОПФ</name>
    <type>
      <types>CatalogRef.КлассификаторОКОПФ</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступаКонтрагента</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусКонтрагента</name>
    <type>
      <types>EnumRef.абсСтатусыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипыКонтрагентов</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПравовойДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПроверкиДЭБ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Куратор</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_НаименованиеПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_НаименованиеБиллинг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусРабот</name>
    <type>
      <types>CatalogRef.абс_СтатусыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Агент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПризнакРЖД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Инициатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КураторХТТК</name>
    <type>
      <types>CatalogRef.абс_Кураторы</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПрошлыйСтатус</name>
    <type>
      <types>EnumRef.абсСтатусыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КураторНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КураторКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОсновнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Конфиденциальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОрганизацияИнициаторКонтрагента</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Страна</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипКонтрагентаМСФО</name>
    <type>
      <types>EnumRef.абс_ТипКонтрагентаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИспользуетсяВКадровомМодуле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаРожденияФизЛица</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ПроверенВИФНС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыДеятельности</name>
    <comment>(Упр)</comment>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.ВидыДеятельностиКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МенеджерыПокупателя</name>
    <comment>(Упр)</comment>
    <attributes>
      <name>МенеджерПокупателя</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/DataProcessors/ПомощникПодготовкиУведомленияОКонтролируемыхСделках/Forms/ФормаВзаимозависимыеЛица/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьОтборВзаимозависимыхЛиц()
	
	ЭлементОтбораДанных = ВзаимозависимыеЛица.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	ЭлементОтбораДанных.Использование = Истина;
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбораДанных.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбораДанных.ПравоеЗначение = Параметры.Организация; 	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	УстановитьОтборВзаимозависимыхЛиц();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНаСервере(ДатаНачала, КонтрагентыБезСтраны)
// +++ввв 24.03.2016 г.
	Перем СписокОфшоров;
	
	СписокОфшоров=Новый ТаблицаЗначений;
	СписокОфшоров.Колонки.Добавить("СтранаРегистрации");
	КонтролируемыеСделки.ЗаполнитьТаблицуОфшоров(СписокОфшоров);
// ---ввв 24.03.2016 г.	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка.Наименование";
	
	Запрос.УстановитьПараметр("ИНН", "7708503727");
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		йКонтрагент = ВыборкаДетальныеЗаписи.Ссылка;
		Для каждого Организация Из Взаимозависимыелица.Отбор.Элементы[0].ПравоеЗначение Цикл
			НаборЗаписей = РегистрыСведений.ВзаимозависимыеЛица.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контрагент.Установить(ВыборкаДетальныеЗаписи.Ссылка);
			НаборЗаписей.Отбор.Организация.Установить(Организация);
			
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись =  НаборЗаписей.Добавить();
				НоваяЗапись.Контрагент    = йКонтрагент;
				НоваяЗапись.Организация   = Организация;
				НоваяЗапись.Период        = НачалоГода(ДатаНачала);
				
				НоваяЗапись.ТипВзаимозависимости  = Перечисления.ТипыВзаимозависимости.ВзаимозависимыПоКодексу;
				НоваяЗапись.ЯвляетсяПлательщикомНалогаНаПрибыль = Истина;
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЦикла;
// +++ввв 16.09.2016 г.
		Если ЗначениеЗаполнено(йКонтрагент.абс_Страна) Тогда
			Записи = РегистрыСведений.УчастникиКонтролируемыхСделок.СоздатьНаборЗаписей();
			Записи.Отбор.Контрагент.Значение = йКонтрагент.Ссылка;
			Записи.Отбор.Контрагент.Использование = Истина;
			Запись = Записи.Добавить();           
			Запись.Контрагент = йКонтрагент.Ссылка;
			Запись.СтранаРегистрации = йКонтрагент.абс_Страна;
			Запись.ЗарегистрированВСтранеСЛьготнымНалогообложением =
				?(Запись.СтранаРегистрации = Справочники.КлассификаторСтранМира.Россия,
				Ложь, (СписокОфшоров.Найти(Запись.СтранаРегистрации)<>Неопределено));
			Записи.Записать();
		// Романова Н.Г. 25.10.2016 - #7723268 
		Иначе
			КонтрагентыБезСтраны.Добавить(йКонтрагент);		
		КонецЕсли;
// ---ввв 16.09.2016 г.
	КонецЦикла;
// +++ввв 24.03.2016 г.
	СписокОфшоров.Очистить();
// ---ввв 24.03.2016 г.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписок(Команда)
	ДатаНачала = "";
	ВвестиДату(ДатаНачала,"Введите дату начала действия новых записей",);
	
	Если ДатаНачала <> "" Тогда
		
		// Романова Н.Г. 25.10.2016 - #7723268
		КонтрагентыБезСтраны = Новый Массив;	
		
		ЗаполнитьСписокНаСервере(ДатаНачала, КонтрагентыБезСтраны);
		
		Для Каждого йКонтрагент из КонтрагентыБезСтраны Цикл 
			Текст = "У контрагента " + йКонтрагент + " (код " + йКонтрагент.Код + ") не указана страна.";
			Сообщить(Текст);			
		КонецЦикла;
		// ---Романова Н.Г. 25.10.2016
	КонецЕсли;
	
	// {{KM WARE Агапов Н.А. Заявка №32701 16.11.2015 начало
	ЗаполнитьРегистр();
	// }}KM WARE Агапов Н.А. Заявка №32701 16.11.2015 окончание
КонецПроцедуры

&НаСервере
// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// {{KM WARE Агапов Н.А. Заявка №32701 16.11.2015 начало
Процедура ЗаполнитьРегистр()

	

КонецПроцедуры // ЗаполнитьРегистр() }}KM WARE Агапов Н.А. Заявка №32701 16.11.2015 окончание

&НаСервере
// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ДозаполнитьСтрануНаСервере()
	Перем СписокОфшоров;
	
	СписокОфшоров=Новый ТаблицаЗначений;
	СписокОфшоров.Колонки.Добавить("СтранаРегистрации");
	КонтролируемыеСделки.ЗаполнитьТаблицуОфшоров(СписокОфшоров);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", "7708503727");
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		йКонтрагент = ВыборкаДетальныеЗаписи.Ссылка;
		Если ЗначениеЗаполнено(йКонтрагент.абс_Страна) Тогда
			Записи = РегистрыСведений.УчастникиКонтролируемыхСделок.СоздатьНаборЗаписей();
			Записи.Отбор.Контрагент.Значение = йКонтрагент.Ссылка;
			Записи.Отбор.Контрагент.Использование = Истина;
			Запись = Записи.Добавить();           
			Запись.Контрагент = йКонтрагент.Ссылка;
			Запись.СтранаРегистрации = йКонтрагент.абс_Страна;
			Запись.ЗарегистрированВСтранеСЛьготнымНалогообложением =
				?(Запись.СтранаРегистрации = Справочники.КлассификаторСтранМира.Россия,
				Ложь, (СписокОфшоров.Найти(Запись.СтранаРегистрации)<>Неопределено));
			Записи.Записать();
		КонецЕсли;
	КонецЦикла;
	СписокОфшоров.Очистить();
КонецПроцедуры 

&НаКлиенте
Процедура ДозаполнитьСтрану(Команда)
	ДозаполнитьСтрануНаСервере();
КонецПроцедуры
